fdfea/Capstone_MSP432/get_time.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* Standard includes                                                          */
#include <get_time.h>
#include <stdlib.h>
#include <stdio.h>
#include <unistd.h>
#include <stdbool.h>
#include <mqueue.h>
#include <time.h>
#include <pthread.h>
#include <errno.h>
#include <ctype.h>

/* Simplelink includes                                                        */
#include <ti/drivers/net/wifi/simplelink.h>

/* Driverlib includes */
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include <ti/devices/msp432p4xx/driverlib/aes256.h>

#include <ti/sysbios/hal/Hwi.h>

#include <ti/drivers/apps/Button.h>

/* SlNetSock includes (to enable portability to other interfaces like ETH)    */
#include <ti/drivers/net/wifi/slnetifwifi.h>

/* Common interface includes                                                  */
#include "network_if.h"
#include "uart_term.h"

/* Application includes                                                       */
#include "Board.h"
#include "pthread.h"
#include "ustdlib.h"

#include "rtc.h"
#include "SMO.h"
#include "peripherals.h"

//*****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//*****************************************************************************

/* General application functions */
void TimerPeriodicIntHandler(sigval val);
void LedTimerConfigNStart();
void LedTimerDeinitStop();

void RTC_C_IRQHandler(uintptr_t Arg);
void PORT6_IRQHandler(void);

static void *udpServerThreadProc(void *pArg);
extern void *peripheralThreadProc(void *pArg);

static void SMO_okayButtonHandler(Button_Handle handle, Button_EventMask events);
static void SMO_setButtonIRQ(void);

static int SMO_scheduleNextEvent(SMO_Control *Ctrl, uint8_t Hour, uint8_t Min);
static int SMO_handleEvent(SMO_Control *Ctrl);
static void SMO_stopEvent(void);
static void SMO_handleTimeout(void);

/****************************************************************************************************************
                   GLOBAL VARIABLES
****************************************************************************************************************/
Application_CB App_CB;
demo_Config_t       flashDemoConfigParams = { "cc3120-demo",
                                              "password",
                                              SL_WLAN_SEC_TYPE_WPA_WPA2,
                                              0xFF,
                                              "Dallas, US",
                                              0xFA,         // GMT-6
                                              0xFF }; //simplelinkapps1, ecsapps1

pthread_t gProvisioningThread   = (pthread_t) NULL;

/* AP Security Parameters */
SlWlanSecParams_t SecurityParams = { 0 };

/* Date and Time Parameters */
const uint8_t SNTPserver[30] = "time-c.nist.gov";

//RTC calendar
static volatile RTC_C_Calendar newTime;

//booleans to notify threads to stop
volatile bool udpThreadStop;
volatile bool peripheralThreadStop;
volatile bool speakerStop;

//controller for smart medication organizer
static SMO_Control SMO_Ctrl;
static pthread_mutex_t SMO_Mutex;

//handle for okay button (msp button)
static Button_Handle okayButtonHandle;

//handle for button hwi (external button)
static Hwi_Handle ButtonHwi;

static const uint8_t AesKey256[32] = {
    0xB3, 0x85, 0xBB, 0x33, 0x0C, 0x98, 0xAA, 0x5D,
    0xFA, 0x02, 0x6E, 0x2B, 0xE3, 0x78, 0xBA, 0x53,
    0xAF, 0xDF, 0xAF, 0xBE, 0xA5, 0x05, 0x5D, 0x52,
    0xC5, 0x5C, 0xCE, 0xCE, 0x6C, 0x1E, 0x84, 0x47
};

//buffer to hold decrypted SMO_Packet
static uint8_t DataAESdecrypted[16][AES256_BLOCKSIZE];

extern bool speakerOn;

/****************************************************************************************************************
                   Banner VARIABLES
****************************************************************************************************************/
char lineBreak[]                = "\n\r";

/****************************************************************************************************************
                 Local Functions
****************************************************************************************************************/
int32_t WiFi_IF_Connect(void);

//*****************************************************************************
//
// Push Button Handler1(GPIOSW2). Press push button1 (GPIOSW2) Whenever user
// wants to publish a message. Write message into message queue signaling the
// event publish messages
//
//*****************************************************************************
void pushButtonInterruptHandler2(uint_least8_t index)
{
    /* Disable the SW2 interrupt */
    GPIO_disableInt(Board_BUTTON0);
}

//*****************************************************************************
//
// Push Button Handler2(GPIOSW3). Press push button3 Whenever user wants to
// disconnect from the remote broker. Write message into message queue
// indicating disconnect from broker.
//
//*****************************************************************************
void pushButtonInterruptHandler3(uint_least8_t index)
{
    /* Disable the SW3 interrupt */
    GPIO_disableInt(Board_BUTTON1);
}

//*****************************************************************************
//
// Application Boarders display on UART
//
//*****************************************************************************
void printBorder(char ch, int n)
{
    int        i = 0;

    for(i=0; i<n; i++)    putch(ch);
}

//*****************************************************************************
//
// Periodic Timer Interrupt Handler
//
//*****************************************************************************
void TimerPeriodicIntHandler(sigval val)
{
    /* Increment our interrupt counter.                                       */
    App_CB.timerInts++;

    if (!(App_CB.timerInts & 0x1))
    {
        /* Turn Led Off                                                       */
        GPIO_write(Board_LED0, Board_LED_OFF);
    }
    else
    {
        /* Turn Led On                                                        */
        GPIO_write(Board_LED0, Board_LED_ON);
    }
}

//*****************************************************************************
//
// Function to configure and start timer to blink the LED while device is
// trying to connect to an AP
//
//*****************************************************************************
void LedTimerConfigNStart()
{
    struct itimerspec value;
    sigevent sev;

