fdfea/Capstone_MSP432/get_time.c
    return 0;
}

static int32_t createConnectionforDate(void)
{
    int32_t sd = 0;
    struct SlTimeval_t TimeVal;

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if( sd < 0 )
    {
        UART_PRINT(" Error creating socket\n\r\n\r");
        ASSERT_ON_ERROR(sd);
    }

    TimeVal.tv_sec = TIMEOUT_SEC;
    TimeVal.tv_usec = TIMEOUT_USEC;
    sl_SetSockOpt(sd,SL_SOL_SOCKET,SL_SO_RCVTIMEO, (_u8 *)&TimeVal,sizeof(TimeVal));

    return sd;
}

static int32_t getSNTPTime(int16_t gmt_hr, int16_t gmt_min)
{
    SlSockAddrIn_t  LocalAddr;
    SlSockAddr_t Addr;

    uint8_t    dataBuf[48];
    int32_t    retVal = -1;
    int32_t    AddrSize = 0;

    /* For time zone with negative GMT value, change minutes to negative for
     * computation */
    if(gmt_hr < 0 && gmt_min > 0)
        gmt_min = gmt_min * (-1);

    memset(dataBuf, 0, sizeof(dataBuf));
    dataBuf[0] = '\x1b';

    Addr.sa_family = SL_AF_INET;
    /* the source port */
    Addr.sa_data[0] = 0x00;
    Addr.sa_data[1] = 0x7B;    /* 123 */
    Addr.sa_data[2] = (uint8_t)((App_CB.timeDestinationIP >> 24) & 0xff);
    Addr.sa_data[3] = (uint8_t)((App_CB.timeDestinationIP >> 16) & 0xff);
    Addr.sa_data[4] = (uint8_t)((App_CB.timeDestinationIP >> 8) & 0xff);
    Addr.sa_data[5] = (uint8_t) (App_CB.timeDestinationIP & 0xff);

    retVal = sl_SendTo(App_CB.timeSockID, dataBuf, sizeof(dataBuf), 0,
                     &Addr, sizeof(Addr));

    if (retVal != sizeof(dataBuf))
    {
        /* could not send SNTP request */
        UART_PRINT(" Device couldn't send SNTP request\n\r\n\r");
    }

    AddrSize = sizeof(SlSockAddrIn_t);
    LocalAddr.sin_family = SL_AF_INET;
    LocalAddr.sin_port = 0;
    LocalAddr.sin_addr.s_addr = SL_INADDR_ANY/*0*/;

    retVal = sl_RecvFrom(App_CB.timeSockID, dataBuf, sizeof(dataBuf), 0,
                       (SlSockAddr_t *)&LocalAddr,  (SlSocklen_t*)&AddrSize);
    if (retVal <= 0)
    {
        UART_PRINT(" Device couldn't receive time information \n\r");
    }

    if ((dataBuf[0] & 0x7) != 4) /* expect only server response */
    {
        /* MODE is not server, abort */
        UART_PRINT(" Device is expecting response from server only!\n\r");
    }
    else
    {
        App_CB.timeElapsedSec = dataBuf[40];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[41];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[42];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[43];
    }

    return 0;
}

static int32_t getTime()
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.timeHostName, (const char *)SNTPserver);

    retVal = getHostIPforDate();
    if(retVal < 0)
    {
        UART_PRINT(" Unable to reach Host\n\r\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.timeSockID = createConnectionforDate();
    ASSERT_ON_ERROR(App_CB.timeSockID);

    retVal = getSNTPTime(flashDemoConfigParams.gmtTimeZoneHR,
                         GMT_TIME_ZONE_MIN);
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.timeSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

static void *udpServerThreadProc(void* pArg)
{
    int32_t sd = 0;
    int32_t retVal = -1;
    SlSocklen_t ServerSize, ClientSize;
    struct SlTimeval_t TimeVal;
    SlSockAddrIn_t ServerAddr, ClientAddr;
    uint8_t DataBuf[16][16];
    int nBytes;

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if(sd < 0)
    {
        UART_PRINT("Socket create failed\n\r\n\r");
        return NULL;
    }

    TimeVal.tv_sec = 10;
    TimeVal.tv_usec = 0;
    sl_SetSockOpt(sd, SL_SOL_SOCKET, SL_SO_RCVTIMEO, (_u8 *)&TimeVal, sizeof(TimeVal));

    ServerSize = sizeof(ServerAddr);
    ServerAddr.sin_family = SL_AF_INET;
    ServerAddr.sin_port = sl_Htons(DATA_PORT);
    ServerAddr.sin_addr.s_addr = sl_Htonl(SL_INADDR_ANY);

    retVal = sl_Bind(sd, (SlSockAddr_t *)&ServerAddr, ServerSize);
    if (retVal < 0)
    {
        UART_PRINT("Socket bind failed\r\n");
        return NULL;
    }

    UART_PRINT("Listening on port %d...\r\n", DATA_PORT);

    while (!udpThreadStop)
    {
        ClientSize = sizeof(SlSockAddrIn_t);
        memset(&ClientAddr, 0, ClientSize);
        memset(DataBuf, 0, sizeof(DataBuf));

        nBytes = sl_RecvFrom(sd, DataBuf, sizeof(DataBuf), 0,
                             (SlSockAddr_t *)&ClientAddr, (SlSocklen_t*)&ClientSize);
        if (nBytes <= 0)
        {
            //UART_PRINT("Recieve timed out\n\r");
            continue;
        }

        UART_PRINT("Recieved %d bytes\r\n", nBytes);

        /*
         * Expected SMO Data Packet Structure
         * ======================================================
         * 1 byte -- Medication Event packet header type (0x98)
         * ------------------------------------------------------
         * 1 byte -- how many Medication Events (1-6)
         * ======================================================
         * n * (35) bytes -- array of Medication Events
         * ======================================================
         * Medication Event Data Structure
         * ======================================================
         * 1 byte -- hour to take (0-23)
         * ------------------------------------------------------
         * 1 byte -- min to take (0-59)
         * ------------------------------------------------------
         * 1 byte -- how many to take (1-5)
         * ------------------------------------------------------
         * 1 byte -- which compartment (1-6)
         * ------------------------------------------------------
         * 1 byte -- length used by medication information
         * ------------------------------------------------------
         * 30 bytes (chars) -- medication information
         * ======================================================
         */
        int Res = 0;

        //AES-256 decrypt the packet
        int nBlocks = nBytes / AES256_BLOCKSIZE + (nBytes % AES256_BLOCKSIZE != 0);
        nBlocks = nBlocks > 16 ? 16 : nBlocks;
        AES256_setDecipherKey(AES256_BASE, AesKey256, AES256_KEYLENGTH_256BIT);
        int i;
        for (i = 0; i < nBlocks; i++)
        {
            AES256_decryptData(AES256_BASE, DataBuf[i], DataAESdecrypted[i]);
        }

        //check packet type
        if (DataAESdecrypted[0][0] != SMO_PACKET_TYPE_HEADER)
        {
            UART_PRINT("Invalid packet type recieved\r\n");
            continue;
        }

        uint8_t nMeds = DataAESdecrypted[0][1];
        if (nMeds == 0 || nMeds > SMO_PACKET_MAX_MEDS)
        {
            UART_PRINT("Invalid number of meds recieved\r\n");
            continue;
        }

        //copy received data into packet
        SMO_Packet Pkt;
        memcpy(&Pkt, DataAESdecrypted, SMO_PACKET_HEADER_SIZE + nMeds*sizeof(SMO_PacketMed));

        newTime = MAP_RTC_C_getCalendarTime();

        //configure SMO from user data
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
            continue;
        }

