fdfea/Capstone_MSP432/get_time.c
        //schedule next event
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }
    }

    retVal = sl_Close(sd);
    if (retVal < 0)
    {
        UART_PRINT("Socket close failed\r\n");
    }

    return NULL;
}

/****************************************************************************************************************
                 Main Thread
****************************************************************************************************************/
void mainThread(void *args)
{
    int32_t retc = 0;

    /* Thread vars */
    pthread_t spawn_thread = (pthread_t) NULL;
    pthread_attr_t pAttrs_spawn;
    struct sched_param priParam;

    //Button_Params  buttonParams;

    /* Peripheral parameters and handles */
    UART_Handle tUartHndl;

    /* Clear lockUDID */
    memset(&App_CB.lockUDID[0], 0x00, sizeof(App_CB.lockUDID));

    /* Initialize SlNetSock layer with CC3x20 interface */
    SlNetIf_init(0);
    SlNetIf_add(SLNETIF_ID_1, "CC3220", (const SlNetIf_Config_t *) &SlNetIfConfigWifi, SLNET_IF_WIFI_PRIO);

    SlNetSock_init(0);
    SlNetUtil_init(0);

    /* Init pins used as GPIOs */
    GPIO_init();

    /* Init buttons driver */
    //Button_init();

    /* Init SPI for communicating between M4 and NWP */
    SPI_init();

    /* Initialize the real-time clock */
    RTC_init();

    /* Initalize the SMO data structure */
    SMO_Control_init(&SMO_Ctrl);

    /* Configure the UART */
    tUartHndl = InitTerm();
    /* remove uart receive from LPDS dependency */
    UART_control(tUartHndl, UART_CMD_RXDISABLE, NULL);

    pthread_mutexattr_t Attr;
    pthread_mutexattr_init(&Attr);
    pthread_mutexattr_settype(&Attr, PTHREAD_MUTEX_RECURSIVE);
    pthread_mutex_init(&SMO_Mutex, &Attr);

    /* Create the sl_Task */
    pthread_attr_init(&pAttrs_spawn);
    priParam.sched_priority = SPAWN_TASK_PRIORITY;
    retc |= pthread_attr_setschedparam(&pAttrs_spawn, &priParam);
    retc |= pthread_attr_setstacksize(&pAttrs_spawn, TASK_STACK_SIZE);
    retc |= pthread_attr_setdetachstate(&pAttrs_spawn, PTHREAD_CREATE_DETACHED);
    retc |= pthread_create(&spawn_thread, &pAttrs_spawn, sl_Task, NULL);
    if (retc != 0)
    {
        UART_PRINT("could not create simplelink task\n\r");
        while (1);
    }

    /* Started to allow host to read back MAC address when printing App banner */
    retc = sl_Start(0, 0, 0);
    if (retc < 0)
    {
        UART_PRINT("\n sl_Start failed\n");
        while (1);
    }

    //Output device information to the UART terminal
    retc = DisplayAppBanner(APPLICATION_NAME, APPLICATION_VERSION);

    retc = sl_Stop(SL_STOP_TIMEOUT);
    if (retc < 0)
    {
        UART_PRINT("\n sl_Stop failed\n");
        while (1);
    }

    /*
    Button_Params_init(&buttonParams);
    okayButtonHandle = Button_open(CONFIG_BUTTON_0, SMO_okayButtonHandler, &buttonParams);
    if (okayButtonHandle == NULL)
    {
        UART_PRINT("Button open failed\r\n");
    }
    */

    /* Set external button interrupt */
    SMO_setButtonIRQ();

    /* Initialize LEDs */
    LED_init();

    /* Initialize screen and display loading screen */
    Screen_init();//

    /* Initialize speaker */
    Speaker_init();

    /* Main application loop */
    while (1)
    {
        UART_PRINT("\n\r\n\r**** Starting main loop ****\n\r");

        App_CB.resetApplication = false;
        App_CB.initState = 0;

        /* Connect to AP */
        UART_PRINT("Using hardcoded profile for connection.\n\r");
        App_CB.apConnectionState = WiFi_IF_Connect();

        /* Create thread for UDP server, so user can configure device */
        udpThreadStop = false;
        pthread_t udpServerThread;
        pthread_attr_t udpThreadAttr;
        pthread_attr_init(&udpThreadAttr);
        retc |= pthread_attr_setstacksize(&udpThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&udpThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&udpServerThread, &udpThreadAttr, udpServerThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("UDP Server thread create failed\r\n");
            while (1);
        }

        /* Create peripheral thread to update screen periodically */
        peripheralThreadStop = false;
        pthread_t peripheralThread;
        pthread_attr_t peripheralThreadAttr;
        pthread_attr_init(&peripheralThreadAttr);
        retc |= pthread_attr_setstacksize(&peripheralThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&peripheralThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&peripheralThread, &peripheralThreadAttr, peripheralThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("Peripheral thread create failed\r\n");
            while (1);
        }

        //get initial time from server
        retc = getTime();
        App_CB.timeElapsedSec -= TZ_EST_OFFSET_SECS;
        RTC_setTime((time_t) App_CB.timeElapsedSec);

        //send initial date, time, and device ID to screen
        uint8_t IpBytes[4];
        char *Date = RTC_getDate();
        char DateStr[20], DeviceIdStr[25] = {0}, MonthStr[4] = {0};
        newTime = MAP_RTC_C_getCalendarTime();
        memcpy(IpBytes, &(App_CB.staIP), sizeof(IpBytes));
        sprintf(MonthStr, "%c%c%c", Date[4], Date[5], Date[6]);
        snprintf(DateStr, sizeof(DateStr), "%s %d, %d", MonthStr, newTime.dayOfmonth, newTime.year-70);
        snprintf(DeviceIdStr, sizeof(DeviceIdStr), "Device ID: %02X:%02X:%02X:%02X",
                 IpBytes[3], IpBytes[2], IpBytes[1], IpBytes[0]);
        uint_fast8_t Hour = newTime.hours;
        UART_PRINT("Time to screen: %02d:%02d %s\r\n",
                   Hour>12?Hour-12:Hour, newTime.minutes, Hour>=12?"PM":"AM");
        UART_PRINT("Date to screen: %s\r\n", DateStr);
        UART_PRINT("Device ID to screen: %s\r\n", DeviceIdStr);
        Screen_updateTime(newTime.hours, newTime.minutes);
        Screen_updateDate(DateStr);
        Screen_printDeviceId(DeviceIdStr);

        /* Dummy packet data for testing/debugging without wifi */
        /*
        SMO_Packet Pkt;
        Pkt.PacketType = SMO_PACKET_TYPE_HEADER;
        Pkt.nMeds = 3;
        {
            SMO_PacketMed Med1;
            Med1.AlarmHour = 13;
            Med1.AlarmMin = 39;
            Med1.nCmptmt = 0;
            Med1.nPills = 2;
            char *MedInfo1 = "Medicine1";
            Med1.Length = strlen(MedInfo1);
            memcpy(Med1.Payload, MedInfo1, Med1.Length);

