fdfea/Capstone_MSP432/get_time.c
            SMO_PacketMed Med2;
            Med2.AlarmHour = 13;
            Med2.AlarmMin = 40;
            Med2.nCmptmt = 1;
            Med2.nPills = 1;
            char *MedInfo2 = "Medicine2";
            Med2.Length = strlen(MedInfo2);
            memcpy(Med2.Payload, MedInfo2, Med2.Length);

            SMO_PacketMed Med3;
            Med3.AlarmHour = 13;
            Med3.AlarmMin = 40;
            Med3.nCmptmt = 2;
            Med3.nPills = 1;
            char *MedInfo3 = "Medicine3";
            Med3.Length = strlen(MedInfo3);
            memcpy(Med3.Payload, MedInfo3, Med3.Length);

            Pkt.Meds[0] = Med1;
            Pkt.Meds[1] = Med2;
            Pkt.Meds[2] = Med3;
        }

        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
        }

        newTime = MAP_RTC_C_getCalendarTime();
        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }
        */

        UART_PRINT("Starting main loop\r\n");

        while (App_CB.resetApplication == false)
        {
            char *Date = RTC_getDate();

            /* Print date periodically so we know app is still alive */
            UART_PRINT("Date: %s\r\n", Date);

            sleep(10);
        }

        udpThreadStop = true;
        peripheralThreadStop = true;

        pthread_join(udpServerThread, NULL);
        pthread_join(peripheralThread, NULL);
    }
}

/*
 * Interrupt handler for RTC alarms and events
 */
extern void RTC_C_IRQHandler(uintptr_t Arg)
{
    uint32_t Status;

    Status = MAP_RTC_C_getEnabledInterruptStatus();
    MAP_RTC_C_clearInterruptFlag(Status);

    newTime = MAP_RTC_C_getCalendarTime();

    if (Status & RTC_C_CLOCK_READ_READY_INTERRUPT)
    {

    }

    if (Status & RTC_C_TIME_EVENT_INTERRUPT)
    {
        UART_PRINT("RTC Int: Minute Passed\r\n");

        //update screen time display every minute
        uint_fast8_t Hour = newTime.hours;
        UART_PRINT("Updating screen time: %02d:%02d %s\r\n",
                   Hour>12?Hour-12:Hour, newTime.minutes, Hour>=12?"PM":"AM");
        Screen_updateTime(newTime.hours, newTime.minutes);

        //on a new day, update the date
        if (newTime.hours == 0 && newTime.minutes == 0)
        {
            char *Date = RTC_getDate();
            char DateStr[20], MonthStr[4] = {0};
            sprintf(MonthStr, "%c%c%c", Date[4], Date[5], Date[6]);
            snprintf(DateStr, sizeof(DateStr), "%s %d, %d", MonthStr, newTime.dayOfmonth, newTime.year-70);
            UART_PRINT("Update screen date: %s\r\n", DateStr);
            Screen_updateDate(DateStr);
        }

        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Ctrl.Timer.Count++;
            if (SMO_Ctrl.Timer.Count == SMO_EVENT_TIMEOUT_MINS)
            {
                SMO_Timer_stop(&SMO_Ctrl.Timer);
                pthread_mutex_lock(&SMO_Mutex);
                SMO_handleTimeout();
                pthread_mutex_unlock(&SMO_Mutex);
            }
        }
        //leave the lights and screen on for an extra minute
        if (SMO_Ctrl.Timer.Delaying)
        {
            SMO_Ctrl.Timer.Delay--;
            if (SMO_Ctrl.Timer.Delay <= 0)
            {
                SMO_Ctrl.Timer.Delaying = false;
                SMO_Ctrl.Timer.Delay = 0;
                pthread_mutex_lock(&SMO_Mutex);
                SMO_stopEvent();
                pthread_mutex_unlock(&SMO_Mutex);
            }
        }
    }

    if (Status & RTC_C_CLOCK_ALARM_INTERRUPT)
    {
        int Res = 0;
        UART_PRINT("RTC Int: Alarm Triggered\r\n");

        pthread_mutex_lock(&SMO_Mutex);
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Timer_stop(&SMO_Ctrl.Timer);
            SMO_stopEvent();
        }
        Res = SMO_handleEvent(&SMO_Ctrl);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error handling event\r\n");
        }
        else
        {
            SMO_Timer_start(&SMO_Ctrl.Timer);
        }

        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error scheduling next event\r\n");
        }
    }
}

/*
 * Interrupt handler for MSP button
 */
/*
static void SMO_okayButtonHandler(Button_Handle handle, Button_EventMask events)
{
    if (Button_EV_CLICKED == (events & Button_EV_CLICKED))
    {
        UART_PRINT("Okay button clicked\r\n");
        //user presses button to acknowledge event
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Timer_stop(&SMO_Ctrl.Timer);
            if (!SMO_Ctrl.Timer.Delaying)
            {
                SMO_Ctrl.Timer.Delaying = true;
                SMO_Ctrl.Timer.Delay = 1;
            }
            pthread_mutex_lock(&SMO_Mutex);
            SMO_stopEvent();
            pthread_mutex_lock(&SMO_Mutex);
        }
    }
}
*/

/*
 * Create interrupt for external button handler
 */
static void SMO_setButtonIRQ(void)
{
    MAP_GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P6, GPIO_PIN2);
    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P6, GPIO_PIN2);
    MAP_GPIO_enableInterrupt(GPIO_PORT_P6, GPIO_PIN2);
    MAP_GPIO_interruptEdgeSelect(GPIO_PORT_P6, GPIO_PIN2, GPIO_LOW_TO_HIGH_TRANSITION);
    MAP_Interrupt_enableInterrupt(INT_PORT6);

    Hwi_Params HwiParams;
    Hwi_Params_init(&HwiParams);
    HwiParams.priority = 0x41;

    ButtonHwi = (Hwi_Handle) Hwi_create(INT_PORT6, PORT6_IRQHandler, &HwiParams, NULL);
    if (ButtonHwi == NULL)
    {
        UART_PRINT("Error creating button interrupt\r\n");
        while (1);
    }
}

/*
 * Interrupt handler for external button
 */
void PORT6_IRQHandler(void)
{
    uint32_t Status;

    Status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P6);

    if (Status & GPIO_PIN2)
    {
        GPIO_clearInterruptFlag(GPIO_PORT_P6, GPIO_PIN2);
        UART_PRINT("Button clicked\r\n");
        //user pressed button to acknowledge event
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Timer_stop(&SMO_Ctrl.Timer);
            if (!SMO_Ctrl.Timer.Delaying)
            {
                SMO_Ctrl.Timer.Delaying = true;
                SMO_Ctrl.Timer.Delay = 1;
            }
            pthread_mutex_lock(&SMO_Mutex);
            SMO_stopEvent();
            pthread_mutex_lock(&SMO_Mutex);
        }
    }
}

static void SMO_handleTimeout(void)
{
    UART_PRINT("Event timer timed out\r\n");
    //when timer goes off, stop peripherals
    SMO_stopEvent();
}

