fdfea/Capstone_MSP432/get_time.c
static void SMO_stopEvent(void)
{
    UART_PRINT("Stopping SMO event\r\n");

    //turn off speaker
    if (speakerOn)
    {
        UART_PRINT("Turning off speaker\r\n");
        Speaker_off();
    }

    //delay so user doesn't forget which meds to take
    if (!SMO_Ctrl.Timer.Delaying)
    {
        //stop LEDs
        UART_PRINT("Turning off LEDs\r\n");
        LED_allOff();

        //remove med info from screen
        UART_PRINT("Removing med info\r\n");
        Screen_removeMedInfo();
    }
}

static int SMO_scheduleNextEvent(SMO_Control *Ctrl, uint8_t Hour, uint8_t Min)
{
    int Res = 0;

    SMO_Event *NextEvent = SMO_Control_nextEvent(Ctrl, Hour, Min);
    if (NextEvent == NULL)
    {
        UART_PRINT("No event available\r\n");
        Res = -EINVAL;
        goto Error;
    }

    UART_PRINT("Scheduling next event for %02d:%02d\r\n", NextEvent->AlarmHour, NextEvent->AlarmMin);
    //set an alarm for the next event
    RTC_setAlarm(NextEvent->AlarmMin, NextEvent->AlarmHour, RTC_C_ALARMCONDITION_OFF, RTC_C_ALARMCONDITION_OFF);

    //save the event so we know what to do when alarm triggers
    Ctrl->CurrentEvent = NextEvent;

Error:
    return Res;
}

static int SMO_handleEvent(SMO_Control *Ctrl)
{
    int Res = 0;
    char ScreenStr[255];
    char *BeginStr = &ScreenStr[0], *CurrentStr = &ScreenStr[0], *MedStr = NULL;
    uint8_t Tmp, Index, Compartments = Ctrl->CurrentEvent->Compartments;

    if (Ctrl->CurrentEvent == NULL)
    {
        UART_PRINT("No event ready\r\n");
        Res = -EINVAL;
        goto Error;
    }

    UART_PRINT("Starting SMO event\r\n");

    while (Compartments != 0ULL)
    {
        Tmp = Compartments & -Compartments;
        Index = 31 - __CLZ(Tmp);

        //handle LEDs
        UART_PRINT("Lighting LED %d\r\n", Index);
        LED_on(Index);

        //add med info to screen string
        MedStr = SMO_Control_getMedStr(Ctrl, Index);
        if (MedStr != NULL)
        {
            char CmptChar = 'A' + Index;
            CurrentStr += sprintf(CurrentStr, "%s, Compartment: %c, Pills: %d\r\n",
                                  MedStr, CmptChar, Ctrl->CurrentEvent->nPills[Index]);
        }

        Compartments ^= Tmp;
    }

    //display med info
    UART_PRINT("Displaying on screen:\r\n%s", BeginStr);
    Screen_printMedInfo(ScreenStr);

    //turn on speaker
    UART_PRINT("Turning speaker on\r\n");
    Speaker_on();

Error:
    return Res;
}
